garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
// Register: SPI1INTF
#define SPI1INTF SPI1INTF
SPI1INTF                                 equ 008Ah
// bitfield definitions
SPI1INTF_TXUIF_POSN                      equ 0001h
SPI1INTF_TXUIF_POSITION                  equ 0001h
SPI1INTF_TXUIF_SIZE                      equ 0001h
SPI1INTF_TXUIF_LENGTH                    equ 0001h
SPI1INTF_TXUIF_MASK                      equ 0002h
SPI1INTF_RXOIF_POSN                      equ 0002h
SPI1INTF_RXOIF_POSITION                  equ 0002h
SPI1INTF_RXOIF_SIZE                      equ 0001h
SPI1INTF_RXOIF_LENGTH                    equ 0001h
SPI1INTF_RXOIF_MASK                      equ 0004h
SPI1INTF_EOSIF_POSN                      equ 0004h
SPI1INTF_EOSIF_POSITION                  equ 0004h
SPI1INTF_EOSIF_SIZE                      equ 0001h
SPI1INTF_EOSIF_LENGTH                    equ 0001h
SPI1INTF_EOSIF_MASK                      equ 0010h
SPI1INTF_SOSIF_POSN                      equ 0005h
SPI1INTF_SOSIF_POSITION                  equ 0005h
SPI1INTF_SOSIF_SIZE                      equ 0001h
SPI1INTF_SOSIF_LENGTH                    equ 0001h
SPI1INTF_SOSIF_MASK                      equ 0020h
SPI1INTF_TCZIF_POSN                      equ 0006h
SPI1INTF_TCZIF_POSITION                  equ 0006h
SPI1INTF_TCZIF_SIZE                      equ 0001h
SPI1INTF_TCZIF_LENGTH                    equ 0001h
SPI1INTF_TCZIF_MASK                      equ 0040h
SPI1INTF_SRMTIF_POSN                     equ 0007h
SPI1INTF_SRMTIF_POSITION                 equ 0007h
SPI1INTF_SRMTIF_SIZE                     equ 0001h
SPI1INTF_SRMTIF_LENGTH                   equ 0001h
SPI1INTF_SRMTIF_MASK                     equ 0080h
SPI1INTF_SPI1TXUIF_POSN                  equ 0001h
SPI1INTF_SPI1TXUIF_POSITION              equ 0001h
SPI1INTF_SPI1TXUIF_SIZE                  equ 0001h
SPI1INTF_SPI1TXUIF_LENGTH                equ 0001h
SPI1INTF_SPI1TXUIF_MASK                  equ 0002h
SPI1INTF_SPI1RXOIF_POSN                  equ 0002h
SPI1INTF_SPI1RXOIF_POSITION              equ 0002h
SPI1INTF_SPI1RXOIF_SIZE                  equ 0001h
SPI1INTF_SPI1RXOIF_LENGTH                equ 0001h
SPI1INTF_SPI1RXOIF_MASK                  equ 0004h
SPI1INTF_SPI1EOSIF_POSN                  equ 0004h
SPI1INTF_SPI1EOSIF_POSITION              equ 0004h
SPI1INTF_SPI1EOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1EOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1EOSIF_MASK                  equ 0010h
SPI1INTF_SPI1SOSIF_POSN                  equ 0005h
SPI1INTF_SPI1SOSIF_POSITION              equ 0005h
SPI1INTF_SPI1SOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1SOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1SOSIF_MASK                  equ 0020h
SPI1INTF_SPI1TCZIF_POSN                  equ 0006h
SPI1INTF_SPI1TCZIF_POSITION              equ 0006h
SPI1INTF_SPI1TCZIF_SIZE                  equ 0001h
SPI1INTF_SPI1TCZIF_LENGTH                equ 0001h
SPI1INTF_SPI1TCZIF_MASK                  equ 0040h
SPI1INTF_SPI1SRMTIF_POSN                 equ 0007h
SPI1INTF_SPI1SRMTIF_POSITION             equ 0007h
SPI1INTF_SPI1SRMTIF_SIZE                 equ 0001h
SPI1INTF_SPI1SRMTIF_LENGTH               equ 0001h
SPI1INTF_SPI1SRMTIF_MASK                 equ 0080h

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
SPI1INTE                                 equ 008Bh
// bitfield definitions
SPI1INTE_TXUIE_POSN                      equ 0001h
SPI1INTE_TXUIE_POSITION                  equ 0001h
SPI1INTE_TXUIE_SIZE                      equ 0001h
SPI1INTE_TXUIE_LENGTH                    equ 0001h
SPI1INTE_TXUIE_MASK                      equ 0002h
SPI1INTE_RXOIE_POSN                      equ 0002h
SPI1INTE_RXOIE_POSITION                  equ 0002h
SPI1INTE_RXOIE_SIZE                      equ 0001h
SPI1INTE_RXOIE_LENGTH                    equ 0001h
SPI1INTE_RXOIE_MASK                      equ 0004h
SPI1INTE_EOSIE_POSN                      equ 0004h
SPI1INTE_EOSIE_POSITION                  equ 0004h
SPI1INTE_EOSIE_SIZE                      equ 0001h
SPI1INTE_EOSIE_LENGTH                    equ 0001h
SPI1INTE_EOSIE_MASK                      equ 0010h
SPI1INTE_SOSIE_POSN                      equ 0005h
SPI1INTE_SOSIE_POSITION                  equ 0005h
SPI1INTE_SOSIE_SIZE                      equ 0001h
SPI1INTE_SOSIE_LENGTH                    equ 0001h
SPI1INTE_SOSIE_MASK                      equ 0020h
SPI1INTE_TCZIE_POSN                      equ 0006h
SPI1INTE_TCZIE_POSITION                  equ 0006h
SPI1INTE_TCZIE_SIZE                      equ 0001h
SPI1INTE_TCZIE_LENGTH                    equ 0001h
SPI1INTE_TCZIE_MASK                      equ 0040h
SPI1INTE_SRMTIE_POSN                     equ 0007h
SPI1INTE_SRMTIE_POSITION                 equ 0007h
SPI1INTE_SRMTIE_SIZE                     equ 0001h
SPI1INTE_SRMTIE_LENGTH                   equ 0001h
SPI1INTE_SRMTIE_MASK                     equ 0080h
SPI1INTE_SPI1TXUIE_POSN                  equ 0001h
SPI1INTE_SPI1TXUIE_POSITION              equ 0001h
SPI1INTE_SPI1TXUIE_SIZE                  equ 0001h
SPI1INTE_SPI1TXUIE_LENGTH                equ 0001h
SPI1INTE_SPI1TXUIE_MASK                  equ 0002h
SPI1INTE_SPI1RXOIE_POSN                  equ 0002h
SPI1INTE_SPI1RXOIE_POSITION              equ 0002h
SPI1INTE_SPI1RXOIE_SIZE                  equ 0001h
SPI1INTE_SPI1RXOIE_LENGTH                equ 0001h
SPI1INTE_SPI1RXOIE_MASK                  equ 0004h
SPI1INTE_SPI1EOSIE_POSN                  equ 0004h
SPI1INTE_SPI1EOSIE_POSITION              equ 0004h
SPI1INTE_SPI1EOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1EOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1EOSIE_MASK                  equ 0010h
SPI1INTE_SPI1SOSIE_POSN                  equ 0005h
SPI1INTE_SPI1SOSIE_POSITION              equ 0005h
SPI1INTE_SPI1SOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1SOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1SOSIE_MASK                  equ 0020h
SPI1INTE_SPI1TCZIE_POSN                  equ 0006h
SPI1INTE_SPI1TCZIE_POSITION              equ 0006h
SPI1INTE_SPI1TCZIE_SIZE                  equ 0001h
SPI1INTE_SPI1TCZIE_LENGTH                equ 0001h
SPI1INTE_SPI1TCZIE_MASK                  equ 0040h
SPI1INTE_SPI1SRMTIE_POSN                 equ 0007h
SPI1INTE_SPI1SRMTIE_POSITION             equ 0007h
SPI1INTE_SPI1SRMTIE_SIZE                 equ 0001h
SPI1INTE_SPI1SRMTIE_LENGTH               equ 0001h
SPI1INTE_SPI1SRMTIE_MASK                 equ 0080h

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
SPI1CLK                                  equ 008Ch
// bitfield definitions
SPI1CLK_CLKSEL_POSN                      equ 0000h
SPI1CLK_CLKSEL_POSITION                  equ 0000h
SPI1CLK_CLKSEL_SIZE                      equ 0008h
SPI1CLK_CLKSEL_LENGTH                    equ 0008h
SPI1CLK_CLKSEL_MASK                      equ 00FFh
SPI1CLK_CLKSEL0_POSN                     equ 0000h
SPI1CLK_CLKSEL0_POSITION                 equ 0000h
SPI1CLK_CLKSEL0_SIZE                     equ 0001h
SPI1CLK_CLKSEL0_LENGTH                   equ 0001h
SPI1CLK_CLKSEL0_MASK                     equ 0001h
SPI1CLK_CLKSEL1_POSN                     equ 0001h
SPI1CLK_CLKSEL1_POSITION                 equ 0001h
SPI1CLK_CLKSEL1_SIZE                     equ 0001h
SPI1CLK_CLKSEL1_LENGTH                   equ 0001h
SPI1CLK_CLKSEL1_MASK                     equ 0002h
SPI1CLK_CLKSEL2_POSN                     equ 0002h
SPI1CLK_CLKSEL2_POSITION                 equ 0002h
SPI1CLK_CLKSEL2_SIZE                     equ 0001h
SPI1CLK_CLKSEL2_LENGTH                   equ 0001h
SPI1CLK_CLKSEL2_MASK                     equ 0004h
SPI1CLK_CLKSEL3_POSN                     equ 0003h
SPI1CLK_CLKSEL3_POSITION                 equ 0003h
SPI1CLK_CLKSEL3_SIZE                     equ 0001h
SPI1CLK_CLKSEL3_LENGTH                   equ 0001h
SPI1CLK_CLKSEL3_MASK                     equ 0008h
SPI1CLK_CLKSEL4_POSN                     equ 0004h
SPI1CLK_CLKSEL4_POSITION                 equ 0004h
SPI1CLK_CLKSEL4_SIZE                     equ 0001h
SPI1CLK_CLKSEL4_LENGTH                   equ 0001h
SPI1CLK_CLKSEL4_MASK                     equ 0010h
SPI1CLK_SPI1CLKSEL_POSN                  equ 0000h
SPI1CLK_SPI1CLKSEL_POSITION              equ 0000h
SPI1CLK_SPI1CLKSEL_SIZE                  equ 0008h
SPI1CLK_SPI1CLKSEL_LENGTH                equ 0008h
SPI1CLK_SPI1CLKSEL_MASK                  equ 00FFh
SPI1CLK_SPI1CLKSEL0_POSN                 equ 0000h
SPI1CLK_SPI1CLKSEL0_POSITION             equ 0000h
SPI1CLK_SPI1CLKSEL0_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL0_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL0_MASK                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSN                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSITION             equ 0001h
SPI1CLK_SPI1CLKSEL1_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL1_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL1_MASK                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSN                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSITION             equ 0002h
SPI1CLK_SPI1CLKSEL2_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL2_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL2_MASK                 equ 0004h
SPI1CLK_SPI1CLKSEL3_POSN                 equ 0003h
SPI1CLK_SPI1CLKSEL3_POSITION             equ 0003h
SPI1CLK_SPI1CLKSEL3_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL3_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL3_MASK                 equ 0008h
SPI1CLK_SPI1CLKSEL4_POSN                 equ 0004h
SPI1CLK_SPI1CLKSEL4_POSITION             equ 0004h
SPI1CLK_SPI1CLKSEL4_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL4_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL4_MASK                 equ 0010h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 00ACh
// bitfield definitions
ACTCON_ORS_POSN                          equ 0001h
ACTCON_ORS_POSITION                      equ 0001h
ACTCON_ORS_SIZE                          equ 0001h
ACTCON_ORS_LENGTH                        equ 0001h
ACTCON_ORS_MASK                          equ 0002h
ACTCON_LOCK_POSN                         equ 0003h
ACTCON_LOCK_POSITION                     equ 0003h
ACTCON_LOCK_SIZE                         equ 0001h
ACTCON_LOCK_LENGTH                       equ 0001h
ACTCON_LOCK_MASK                         equ 0008h
ACTCON_UD_POSN                           equ 0006h
ACTCON_UD_POSITION                       equ 0006h
ACTCON_UD_SIZE                           equ 0001h
ACTCON_UD_LENGTH                         equ 0001h
ACTCON_UD_MASK                           equ 0040h
ACTCON_EN_POSN                           equ 0007h
ACTCON_EN_POSITION                       equ 0007h
ACTCON_EN_SIZE                           equ 0001h
ACTCON_EN_LENGTH                         equ 0001h
ACTCON_EN_MASK                           equ 0080h
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

// Register: OSCCON1
#define OSCCON1 OSCCON1
OSCCON1                                  equ 00ADh
// bitfield definitions
OSCCON1_NDIV_POSN                        equ 0000h
OSCCON1_NDIV_POSITION                    equ 0000h
OSCCON1_NDIV_SIZE                        equ 0004h
OSCCON1_NDIV_LENGTH                      equ 0004h
OSCCON1_NDIV_MASK                        equ 000Fh
OSCCON1_NOSC_POSN                        equ 0004h
OSCCON1_NOSC_POSITION                    equ 0004h
OSCCON1_NOSC_SIZE                        equ 0003h
OSCCON1_NOSC_LENGTH                      equ 0003h
OSCCON1_NOSC_MASK                        equ 0070h
OSCCON1_NDIV0_POSN                       equ 0000h
OSCCON1_NDIV0_POSITION                   equ 0000h
OSCCON1_NDIV0_SIZE                       equ 0001h
OSCCON1_NDIV0_LENGTH                     equ 0001h
OSCCON1_NDIV0_MASK                       equ 0001h
OSCCON1_NDIV1_POSN                       equ 0001h
OSCCON1_NDIV1_POSITION                   equ 0001h
OSCCON1_NDIV1_SIZE                       equ 0001h
OSCCON1_NDIV1_LENGTH                     equ 0001h
OSCCON1_NDIV1_MASK                       equ 0002h
OSCCON1_NDIV2_POSN                       equ 0002h
OSCCON1_NDIV2_POSITION                   equ 0002h
OSCCON1_NDIV2_SIZE                       equ 0001h
OSCCON1_NDIV2_LENGTH                     equ 0001h
OSCCON1_NDIV2_MASK                       equ 0004h
OSCCON1_NDIV3_POSN                       equ 0003h
OSCCON1_NDIV3_POSITION                   equ 0003h
OSCCON1_NDIV3_SIZE                       equ 0001h
OSCCON1_NDIV3_LENGTH                     equ 0001h
OSCCON1_NDIV3_MASK                       equ 0008h
OSCCON1_NOSC0_POSN                       equ 0004h
OSCCON1_NOSC0_POSITION                   equ 0004h
OSCCON1_NOSC0_SIZE                       equ 0001h
OSCCON1_NOSC0_LENGTH                     equ 0001h
OSCCON1_NOSC0_MASK                       equ 0010h
OSCCON1_NOSC1_POSN                       equ 0005h
OSCCON1_NOSC1_POSITION                   equ 0005h
OSCCON1_NOSC1_SIZE                       equ 0001h
OSCCON1_NOSC1_LENGTH                     equ 0001h
OSCCON1_NOSC1_MASK                       equ 0020h
OSCCON1_NOSC2_POSN                       equ 0006h
OSCCON1_NOSC2_POSITION                   equ 0006h
OSCCON1_NOSC2_SIZE                       equ 0001h
OSCCON1_NOSC2_LENGTH                     equ 0001h
OSCCON1_NOSC2_MASK                       equ 0040h

// Register: OSCCON2
#define OSCCON2 OSCCON2
OSCCON2                                  equ 00AEh
// bitfield definitions
OSCCON2_CDIV_POSN                        equ 0000h
OSCCON2_CDIV_POSITION                    equ 0000h
OSCCON2_CDIV_SIZE                        equ 0004h
OSCCON2_CDIV_LENGTH                      equ 0004h
OSCCON2_CDIV_MASK                        equ 000Fh
OSCCON2_COSC_POSN                        equ 0004h
OSCCON2_COSC_POSITION                    equ 0004h
OSCCON2_COSC_SIZE                        equ 0003h
OSCCON2_COSC_LENGTH                      equ 0003h
OSCCON2_COSC_MASK                        equ 0070h
OSCCON2_CDIV0_POSN                       equ 0000h
OSCCON2_CDIV0_POSITION                   equ 0000h
OSCCON2_CDIV0_SIZE                       equ 0001h
OSCCON2_CDIV0_LENGTH                     equ 0001h
OSCCON2_CDIV0_MASK                       equ 0001h
OSCCON2_CDIV1_POSN                       equ 0001h
OSCCON2_CDIV1_POSITION                   equ 0001h
OSCCON2_CDIV1_SIZE                       equ 0001h
OSCCON2_CDIV1_LENGTH                     equ 0001h
OSCCON2_CDIV1_MASK                       equ 0002h
OSCCON2_CDIV2_POSN                       equ 0002h
OSCCON2_CDIV2_POSITION                   equ 0002h
OSCCON2_CDIV2_SIZE                       equ 0001h
OSCCON2_CDIV2_LENGTH                     equ 0001h
OSCCON2_CDIV2_MASK                       equ 0004h
OSCCON2_CDIV3_POSN                       equ 0003h
OSCCON2_CDIV3_POSITION                   equ 0003h
OSCCON2_CDIV3_SIZE                       equ 0001h
OSCCON2_CDIV3_LENGTH                     equ 0001h
OSCCON2_CDIV3_MASK                       equ 0008h
OSCCON2_COSC0_POSN                       equ 0004h
OSCCON2_COSC0_POSITION                   equ 0004h
OSCCON2_COSC0_SIZE                       equ 0001h
OSCCON2_COSC0_LENGTH                     equ 0001h
OSCCON2_COSC0_MASK                       equ 0010h
OSCCON2_COSC1_POSN                       equ 0005h
OSCCON2_COSC1_POSITION                   equ 0005h
OSCCON2_COSC1_SIZE                       equ 0001h
OSCCON2_COSC1_LENGTH                     equ 0001h
OSCCON2_COSC1_MASK                       equ 0020h
OSCCON2_COSC2_POSN                       equ 0006h
OSCCON2_COSC2_POSITION                   equ 0006h
OSCCON2_COSC2_SIZE                       equ 0001h
OSCCON2_COSC2_LENGTH                     equ 0001h
OSCCON2_COSC2_MASK                       equ 0040h

// Register: OSCCON3
#define OSCCON3 OSCCON3
OSCCON3                                  equ 00AFh
// bitfield definitions
OSCCON3_NOSCR_POSN                       equ 0003h
OSCCON3_NOSCR_POSITION                   equ 0003h
OSCCON3_NOSCR_SIZE                       equ 0001h
OSCCON3_NOSCR_LENGTH                     equ 0001h
OSCCON3_NOSCR_MASK                       equ 0008h
OSCCON3_ORDY_POSN                        equ 0004h
OSCCON3_ORDY_POSITION                    equ 0004h
OSCCON3_ORDY_SIZE                        equ 0001h
OSCCON3_ORDY_LENGTH                      equ 0001h
OSCCON3_ORDY_MASK                        equ 0010h
OSCCON3_SOSCPWR_POSN                     equ 0006h
OSCCON3_SOSCPWR_POSITION                 equ 0006h
OSCCON3_SOSCPWR_SIZE                     equ 0001h
OSCCON3_SOSCPWR_LENGTH                   equ 0001h
OSCCON3_SOSCPWR_MASK                     equ 0040h
OSCCON3_CSWHOLD_POSN                     equ 0007h
OSCCON3_CSWHOLD_POSITION                 equ 0007h
OSCCON3_CSWHOLD_SIZE                     equ 0001h
OSCCON3_CSWHOLD_LENGTH                   equ 0001h
OSCCON3_CSWHOLD_MASK                     equ 0080h

