garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 00B0h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 00B1h
// bitfield definitions
OSCFRQ_HFFRQ_POSN                        equ 0000h
OSCFRQ_HFFRQ_POSITION                    equ 0000h
OSCFRQ_HFFRQ_SIZE                        equ 0004h
OSCFRQ_HFFRQ_LENGTH                      equ 0004h
OSCFRQ_HFFRQ_MASK                        equ 000Fh
OSCFRQ_FRQ0_POSN                         equ 0000h
OSCFRQ_FRQ0_POSITION                     equ 0000h
OSCFRQ_FRQ0_SIZE                         equ 0001h
OSCFRQ_FRQ0_LENGTH                       equ 0001h
OSCFRQ_FRQ0_MASK                         equ 0001h
OSCFRQ_FRQ1_POSN                         equ 0001h
OSCFRQ_FRQ1_POSITION                     equ 0001h
OSCFRQ_FRQ1_SIZE                         equ 0001h
OSCFRQ_FRQ1_LENGTH                       equ 0001h
OSCFRQ_FRQ1_MASK                         equ 0002h
OSCFRQ_FRQ2_POSN                         equ 0002h
OSCFRQ_FRQ2_POSITION                     equ 0002h
OSCFRQ_FRQ2_SIZE                         equ 0001h
OSCFRQ_FRQ2_LENGTH                       equ 0001h
OSCFRQ_FRQ2_MASK                         equ 0004h
OSCFRQ_FRQ3_POSN                         equ 0003h
OSCFRQ_FRQ3_POSITION                     equ 0003h
OSCFRQ_FRQ3_SIZE                         equ 0001h
OSCFRQ_FRQ3_LENGTH                       equ 0001h
OSCFRQ_FRQ3_MASK                         equ 0008h

// Register: OSCSTAT
#define OSCSTAT OSCSTAT
OSCSTAT                                  equ 00B2h
// bitfield definitions
OSCSTAT_PLLR_POSN                        equ 0000h
OSCSTAT_PLLR_POSITION                    equ 0000h
OSCSTAT_PLLR_SIZE                        equ 0001h
OSCSTAT_PLLR_LENGTH                      equ 0001h
OSCSTAT_PLLR_MASK                        equ 0001h
OSCSTAT_ADOR_POSN                        equ 0002h
OSCSTAT_ADOR_POSITION                    equ 0002h
OSCSTAT_ADOR_SIZE                        equ 0001h
OSCSTAT_ADOR_LENGTH                      equ 0001h
OSCSTAT_ADOR_MASK                        equ 0004h
OSCSTAT_SOR_POSN                         equ 0003h
OSCSTAT_SOR_POSITION                     equ 0003h
OSCSTAT_SOR_SIZE                         equ 0001h
OSCSTAT_SOR_LENGTH                       equ 0001h
OSCSTAT_SOR_MASK                         equ 0008h
OSCSTAT_LFOR_POSN                        equ 0004h
OSCSTAT_LFOR_POSITION                    equ 0004h
OSCSTAT_LFOR_SIZE                        equ 0001h
OSCSTAT_LFOR_LENGTH                      equ 0001h
OSCSTAT_LFOR_MASK                        equ 0010h
OSCSTAT_MFOR_POSN                        equ 0005h
OSCSTAT_MFOR_POSITION                    equ 0005h
OSCSTAT_MFOR_SIZE                        equ 0001h
OSCSTAT_MFOR_LENGTH                      equ 0001h
OSCSTAT_MFOR_MASK                        equ 0020h
OSCSTAT_HFOR_POSN                        equ 0006h
OSCSTAT_HFOR_POSITION                    equ 0006h
OSCSTAT_HFOR_SIZE                        equ 0001h
OSCSTAT_HFOR_LENGTH                      equ 0001h
OSCSTAT_HFOR_MASK                        equ 0040h
OSCSTAT_EXTOR_POSN                       equ 0007h
OSCSTAT_EXTOR_POSITION                   equ 0007h
OSCSTAT_EXTOR_SIZE                       equ 0001h
OSCSTAT_EXTOR_LENGTH                     equ 0001h
OSCSTAT_EXTOR_MASK                       equ 0080h

// Register: OSCEN
#define OSCEN OSCEN
OSCEN                                    equ 00B3h
// bitfield definitions
OSCEN_PLLEN_POSN                         equ 0000h
OSCEN_PLLEN_POSITION                     equ 0000h
OSCEN_PLLEN_SIZE                         equ 0001h
OSCEN_PLLEN_LENGTH                       equ 0001h
OSCEN_PLLEN_MASK                         equ 0001h
OSCEN_ADOEN_POSN                         equ 0002h
OSCEN_ADOEN_POSITION                     equ 0002h
OSCEN_ADOEN_SIZE                         equ 0001h
OSCEN_ADOEN_LENGTH                       equ 0001h
OSCEN_ADOEN_MASK                         equ 0004h
OSCEN_SOSCEN_POSN                        equ 0003h
OSCEN_SOSCEN_POSITION                    equ 0003h
OSCEN_SOSCEN_SIZE                        equ 0001h
OSCEN_SOSCEN_LENGTH                      equ 0001h
OSCEN_SOSCEN_MASK                        equ 0008h
OSCEN_LFOEN_POSN                         equ 0004h
OSCEN_LFOEN_POSITION                     equ 0004h
OSCEN_LFOEN_SIZE                         equ 0001h
OSCEN_LFOEN_LENGTH                       equ 0001h
OSCEN_LFOEN_MASK                         equ 0010h
OSCEN_MFOEN_POSN                         equ 0005h
OSCEN_MFOEN_POSITION                     equ 0005h
OSCEN_MFOEN_SIZE                         equ 0001h
OSCEN_MFOEN_LENGTH                       equ 0001h
OSCEN_MFOEN_MASK                         equ 0020h
OSCEN_HFOEN_POSN                         equ 0006h
OSCEN_HFOEN_POSITION                     equ 0006h
OSCEN_HFOEN_SIZE                         equ 0001h
OSCEN_HFOEN_LENGTH                       equ 0001h
OSCEN_HFOEN_MASK                         equ 0040h
OSCEN_EXTOEN_POSN                        equ 0007h
OSCEN_EXTOEN_POSITION                    equ 0007h
OSCEN_EXTOEN_SIZE                        equ 0001h
OSCEN_EXTOEN_LENGTH                      equ 0001h
OSCEN_EXTOEN_MASK                        equ 0080h

// Register: PRLOCK
#define PRLOCK PRLOCK
PRLOCK                                   equ 00B4h
// bitfield definitions
PRLOCK_PRLOCKED_POSN                     equ 0000h
PRLOCK_PRLOCKED_POSITION                 equ 0000h
PRLOCK_PRLOCKED_SIZE                     equ 0001h
PRLOCK_PRLOCKED_LENGTH                   equ 0001h
PRLOCK_PRLOCKED_MASK                     equ 0001h

// Register: SCANPR
#define SCANPR SCANPR
SCANPR                                   equ 00B5h
// bitfield definitions
SCANPR_PR_POSN                           equ 0000h
SCANPR_PR_POSITION                       equ 0000h
SCANPR_PR_SIZE                           equ 0003h
SCANPR_PR_LENGTH                         equ 0003h
SCANPR_PR_MASK                           equ 0007h
SCANPR_PR0_POSN                          equ 0000h
SCANPR_PR0_POSITION                      equ 0000h
SCANPR_PR0_SIZE                          equ 0001h
SCANPR_PR0_LENGTH                        equ 0001h
SCANPR_PR0_MASK                          equ 0001h
SCANPR_PR1_POSN                          equ 0001h
SCANPR_PR1_POSITION                      equ 0001h
SCANPR_PR1_SIZE                          equ 0001h
SCANPR_PR1_LENGTH                        equ 0001h
SCANPR_PR1_MASK                          equ 0002h
SCANPR_PR2_POSN                          equ 0002h
SCANPR_PR2_POSITION                      equ 0002h
SCANPR_PR2_SIZE                          equ 0001h
SCANPR_PR2_LENGTH                        equ 0001h
SCANPR_PR2_MASK                          equ 0004h
SCANPR_SCANPR_POSN                       equ 0000h
SCANPR_SCANPR_POSITION                   equ 0000h
SCANPR_SCANPR_SIZE                       equ 0003h
SCANPR_SCANPR_LENGTH                     equ 0003h
SCANPR_SCANPR_MASK                       equ 0007h
SCANPR_SCANPR0_POSN                      equ 0000h
SCANPR_SCANPR0_POSITION                  equ 0000h
SCANPR_SCANPR0_SIZE                      equ 0001h
SCANPR_SCANPR0_LENGTH                    equ 0001h
SCANPR_SCANPR0_MASK                      equ 0001h
SCANPR_SCANPR1_POSN                      equ 0001h
SCANPR_SCANPR1_POSITION                  equ 0001h
SCANPR_SCANPR1_SIZE                      equ 0001h
SCANPR_SCANPR1_LENGTH                    equ 0001h
SCANPR_SCANPR1_MASK                      equ 0002h
SCANPR_SCANPR2_POSN                      equ 0002h
SCANPR_SCANPR2_POSITION                  equ 0002h
SCANPR_SCANPR2_SIZE                      equ 0001h
SCANPR_SCANPR2_LENGTH                    equ 0001h
SCANPR_SCANPR2_MASK                      equ 0004h

// Register: DMA1PR
#define DMA1PR DMA1PR
DMA1PR                                   equ 00B6h
// bitfield definitions
DMA1PR_PR_POSN                           equ 0000h
DMA1PR_PR_POSITION                       equ 0000h
DMA1PR_PR_SIZE                           equ 0003h
DMA1PR_PR_LENGTH                         equ 0003h
DMA1PR_PR_MASK                           equ 0007h
DMA1PR_PR0_POSN                          equ 0000h
DMA1PR_PR0_POSITION                      equ 0000h
DMA1PR_PR0_SIZE                          equ 0001h
DMA1PR_PR0_LENGTH                        equ 0001h
DMA1PR_PR0_MASK                          equ 0001h
DMA1PR_PR1_POSN                          equ 0001h
DMA1PR_PR1_POSITION                      equ 0001h
DMA1PR_PR1_SIZE                          equ 0001h
DMA1PR_PR1_LENGTH                        equ 0001h
DMA1PR_PR1_MASK                          equ 0002h
DMA1PR_PR2_POSN                          equ 0002h
DMA1PR_PR2_POSITION                      equ 0002h
DMA1PR_PR2_SIZE                          equ 0001h
DMA1PR_PR2_LENGTH                        equ 0001h
DMA1PR_PR2_MASK                          equ 0004h
DMA1PR_DMA1PR_POSN                       equ 0000h
DMA1PR_DMA1PR_POSITION                   equ 0000h
DMA1PR_DMA1PR_SIZE                       equ 0003h
DMA1PR_DMA1PR_LENGTH                     equ 0003h
DMA1PR_DMA1PR_MASK                       equ 0007h
DMA1PR_DMA1PR0_POSN                      equ 0000h
DMA1PR_DMA1PR0_POSITION                  equ 0000h
DMA1PR_DMA1PR0_SIZE                      equ 0001h
DMA1PR_DMA1PR0_LENGTH                    equ 0001h
DMA1PR_DMA1PR0_MASK                      equ 0001h
DMA1PR_DMA1PR1_POSN                      equ 0001h
DMA1PR_DMA1PR1_POSITION                  equ 0001h
DMA1PR_DMA1PR1_SIZE                      equ 0001h
DMA1PR_DMA1PR1_LENGTH                    equ 0001h
DMA1PR_DMA1PR1_MASK                      equ 0002h
DMA1PR_DMA1PR2_POSN                      equ 0002h
DMA1PR_DMA1PR2_POSITION                  equ 0002h
DMA1PR_DMA1PR2_SIZE                      equ 0001h
DMA1PR_DMA1PR2_LENGTH                    equ 0001h
DMA1PR_DMA1PR2_MASK                      equ 0004h

