garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
DMAnAIRQ                                 equ 00FEh
// bitfield definitions
DMAnAIRQ_AIRQ_POSN                       equ 0000h
DMAnAIRQ_AIRQ_POSITION                   equ 0000h
DMAnAIRQ_AIRQ_SIZE                       equ 0008h
DMAnAIRQ_AIRQ_LENGTH                     equ 0008h
DMAnAIRQ_AIRQ_MASK                       equ 00FFh
DMAnAIRQ_AIRQ0_POSN                      equ 0000h
DMAnAIRQ_AIRQ0_POSITION                  equ 0000h
DMAnAIRQ_AIRQ0_SIZE                      equ 0001h
DMAnAIRQ_AIRQ0_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ0_MASK                      equ 0001h
DMAnAIRQ_AIRQ1_POSN                      equ 0001h
DMAnAIRQ_AIRQ1_POSITION                  equ 0001h
DMAnAIRQ_AIRQ1_SIZE                      equ 0001h
DMAnAIRQ_AIRQ1_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ1_MASK                      equ 0002h
DMAnAIRQ_AIRQ2_POSN                      equ 0002h
DMAnAIRQ_AIRQ2_POSITION                  equ 0002h
DMAnAIRQ_AIRQ2_SIZE                      equ 0001h
DMAnAIRQ_AIRQ2_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ2_MASK                      equ 0004h
DMAnAIRQ_AIRQ3_POSN                      equ 0003h
DMAnAIRQ_AIRQ3_POSITION                  equ 0003h
DMAnAIRQ_AIRQ3_SIZE                      equ 0001h
DMAnAIRQ_AIRQ3_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ3_MASK                      equ 0008h
DMAnAIRQ_AIRQ4_POSN                      equ 0004h
DMAnAIRQ_AIRQ4_POSITION                  equ 0004h
DMAnAIRQ_AIRQ4_SIZE                      equ 0001h
DMAnAIRQ_AIRQ4_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ4_MASK                      equ 0010h
DMAnAIRQ_AIRQ5_POSN                      equ 0005h
DMAnAIRQ_AIRQ5_POSITION                  equ 0005h
DMAnAIRQ_AIRQ5_SIZE                      equ 0001h
DMAnAIRQ_AIRQ5_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ5_MASK                      equ 0020h
DMAnAIRQ_AIRQ6_POSN                      equ 0006h
DMAnAIRQ_AIRQ6_POSITION                  equ 0006h
DMAnAIRQ_AIRQ6_SIZE                      equ 0001h
DMAnAIRQ_AIRQ6_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ6_MASK                      equ 0040h
DMAnAIRQ_AIRQ7_POSN                      equ 0007h
DMAnAIRQ_AIRQ7_POSITION                  equ 0007h
DMAnAIRQ_AIRQ7_SIZE                      equ 0001h
DMAnAIRQ_AIRQ7_LENGTH                    equ 0001h
DMAnAIRQ_AIRQ7_MASK                      equ 0080h

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
DMAnSIRQ                                 equ 00FFh
// bitfield definitions
DMAnSIRQ_SIRQ_POSN                       equ 0000h
DMAnSIRQ_SIRQ_POSITION                   equ 0000h
DMAnSIRQ_SIRQ_SIZE                       equ 0008h
DMAnSIRQ_SIRQ_LENGTH                     equ 0008h
DMAnSIRQ_SIRQ_MASK                       equ 00FFh
DMAnSIRQ_SIRQ0_POSN                      equ 0000h
DMAnSIRQ_SIRQ0_POSITION                  equ 0000h
DMAnSIRQ_SIRQ0_SIZE                      equ 0001h
DMAnSIRQ_SIRQ0_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ0_MASK                      equ 0001h
DMAnSIRQ_SIRQ1_POSN                      equ 0001h
DMAnSIRQ_SIRQ1_POSITION                  equ 0001h
DMAnSIRQ_SIRQ1_SIZE                      equ 0001h
DMAnSIRQ_SIRQ1_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ1_MASK                      equ 0002h
DMAnSIRQ_SIRQ2_POSN                      equ 0002h
DMAnSIRQ_SIRQ2_POSITION                  equ 0002h
DMAnSIRQ_SIRQ2_SIZE                      equ 0001h
DMAnSIRQ_SIRQ2_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ2_MASK                      equ 0004h
DMAnSIRQ_SIRQ3_POSN                      equ 0003h
DMAnSIRQ_SIRQ3_POSITION                  equ 0003h
DMAnSIRQ_SIRQ3_SIZE                      equ 0001h
DMAnSIRQ_SIRQ3_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ3_MASK                      equ 0008h
DMAnSIRQ_SIRQ4_POSN                      equ 0004h
DMAnSIRQ_SIRQ4_POSITION                  equ 0004h
DMAnSIRQ_SIRQ4_SIZE                      equ 0001h
DMAnSIRQ_SIRQ4_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ4_MASK                      equ 0010h
DMAnSIRQ_SIRQ5_POSN                      equ 0005h
DMAnSIRQ_SIRQ5_POSITION                  equ 0005h
DMAnSIRQ_SIRQ5_SIZE                      equ 0001h
DMAnSIRQ_SIRQ5_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ5_MASK                      equ 0020h
DMAnSIRQ_SIRQ6_POSN                      equ 0006h
DMAnSIRQ_SIRQ6_POSITION                  equ 0006h
DMAnSIRQ_SIRQ6_SIZE                      equ 0001h
DMAnSIRQ_SIRQ6_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ6_MASK                      equ 0040h
DMAnSIRQ_SIRQ7_POSN                      equ 0007h
DMAnSIRQ_SIRQ7_POSITION                  equ 0007h
DMAnSIRQ_SIRQ7_SIZE                      equ 0001h
DMAnSIRQ_SIRQ7_LENGTH                    equ 0001h
DMAnSIRQ_SIRQ7_MASK                      equ 0080h

// Register: PORTW
#define PORTW PORTW
PORTW                                    equ 0100h
// bitfield definitions
PORTW_RW0_POSN                           equ 0000h
PORTW_RW0_POSITION                       equ 0000h
PORTW_RW0_SIZE                           equ 0001h
PORTW_RW0_LENGTH                         equ 0001h
PORTW_RW0_MASK                           equ 0001h
PORTW_RW1_POSN                           equ 0001h
PORTW_RW1_POSITION                       equ 0001h
PORTW_RW1_SIZE                           equ 0001h
PORTW_RW1_LENGTH                         equ 0001h
PORTW_RW1_MASK                           equ 0002h
PORTW_RW2_POSN                           equ 0002h
PORTW_RW2_POSITION                       equ 0002h
PORTW_RW2_SIZE                           equ 0001h
PORTW_RW2_LENGTH                         equ 0001h
PORTW_RW2_MASK                           equ 0004h
PORTW_RW3_POSN                           equ 0003h
PORTW_RW3_POSITION                       equ 0003h
PORTW_RW3_SIZE                           equ 0001h
PORTW_RW3_LENGTH                         equ 0001h
PORTW_RW3_MASK                           equ 0008h
PORTW_RW4_POSN                           equ 0004h
PORTW_RW4_POSITION                       equ 0004h
PORTW_RW4_SIZE                           equ 0001h
PORTW_RW4_LENGTH                         equ 0001h
PORTW_RW4_MASK                           equ 0010h
PORTW_RW5_POSN                           equ 0005h
PORTW_RW5_POSITION                       equ 0005h
PORTW_RW5_SIZE                           equ 0001h
PORTW_RW5_LENGTH                         equ 0001h
PORTW_RW5_MASK                           equ 0020h
PORTW_RW6_POSN                           equ 0006h
PORTW_RW6_POSITION                       equ 0006h
PORTW_RW6_SIZE                           equ 0001h
PORTW_RW6_LENGTH                         equ 0001h
PORTW_RW6_MASK                           equ 0040h
PORTW_RW7_POSN                           equ 0007h
PORTW_RW7_POSITION                       equ 0007h
PORTW_RW7_SIZE                           equ 0001h
PORTW_RW7_LENGTH                         equ 0001h
PORTW_RW7_MASK                           equ 0080h

// Register: LATW
#define LATW LATW
LATW                                     equ 0101h
// bitfield definitions
LATW_LATW0_POSN                          equ 0000h
LATW_LATW0_POSITION                      equ 0000h
LATW_LATW0_SIZE                          equ 0001h
LATW_LATW0_LENGTH                        equ 0001h
LATW_LATW0_MASK                          equ 0001h
LATW_LATW1_POSN                          equ 0001h
LATW_LATW1_POSITION                      equ 0001h
LATW_LATW1_SIZE                          equ 0001h
LATW_LATW1_LENGTH                        equ 0001h
LATW_LATW1_MASK                          equ 0002h
LATW_LATW2_POSN                          equ 0002h
LATW_LATW2_POSITION                      equ 0002h
LATW_LATW2_SIZE                          equ 0001h
LATW_LATW2_LENGTH                        equ 0001h
LATW_LATW2_MASK                          equ 0004h
LATW_LATW3_POSN                          equ 0003h
LATW_LATW3_POSITION                      equ 0003h
LATW_LATW3_SIZE                          equ 0001h
LATW_LATW3_LENGTH                        equ 0001h
LATW_LATW3_MASK                          equ 0008h
LATW_LATW4_POSN                          equ 0004h
LATW_LATW4_POSITION                      equ 0004h
LATW_LATW4_SIZE                          equ 0001h
LATW_LATW4_LENGTH                        equ 0001h
LATW_LATW4_MASK                          equ 0010h
LATW_LATW5_POSN                          equ 0005h
LATW_LATW5_POSITION                      equ 0005h
LATW_LATW5_SIZE                          equ 0001h
LATW_LATW5_LENGTH                        equ 0001h
LATW_LATW5_MASK                          equ 0020h
LATW_LATW6_POSN                          equ 0006h
LATW_LATW6_POSITION                      equ 0006h
LATW_LATW6_SIZE                          equ 0001h
LATW_LATW6_LENGTH                        equ 0001h
LATW_LATW6_MASK                          equ 0040h
LATW_LATW7_POSN                          equ 0007h
LATW_LATW7_POSITION                      equ 0007h
LATW_LATW7_SIZE                          equ 0001h
LATW_LATW7_LENGTH                        equ 0001h
LATW_LATW7_MASK                          equ 0080h

// Register: PORTWIN0
#define PORTWIN0 PORTWIN0
PORTWIN0                                 equ 0102h
// bitfield definitions
PORTWIN0_IN_POSN                         equ 0000h
PORTWIN0_IN_POSITION                     equ 0000h
PORTWIN0_IN_SIZE                         equ 0008h
PORTWIN0_IN_LENGTH                       equ 0008h
PORTWIN0_IN_MASK                         equ 00FFh
PORTWIN0_IN0_POSN                        equ 0000h
PORTWIN0_IN0_POSITION                    equ 0000h
PORTWIN0_IN0_SIZE                        equ 0001h
PORTWIN0_IN0_LENGTH                      equ 0001h
PORTWIN0_IN0_MASK                        equ 0001h
PORTWIN0_IN1_POSN                        equ 0001h
PORTWIN0_IN1_POSITION                    equ 0001h
PORTWIN0_IN1_SIZE                        equ 0001h
PORTWIN0_IN1_LENGTH                      equ 0001h
PORTWIN0_IN1_MASK                        equ 0002h
PORTWIN0_IN2_POSN                        equ 0002h
PORTWIN0_IN2_POSITION                    equ 0002h
PORTWIN0_IN2_SIZE                        equ 0001h
PORTWIN0_IN2_LENGTH                      equ 0001h
PORTWIN0_IN2_MASK                        equ 0004h
PORTWIN0_IN3_POSN                        equ 0003h
PORTWIN0_IN3_POSITION                    equ 0003h
PORTWIN0_IN3_SIZE                        equ 0001h
PORTWIN0_IN3_LENGTH                      equ 0001h
PORTWIN0_IN3_MASK                        equ 0008h

