garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
// Register: ADCGB
#define ADCGB ADCGB
ADCGB                                    equ 0111h
// bitfield definitions
ADCGB_CGB0_POSN                          equ 0000h
ADCGB_CGB0_POSITION                      equ 0000h
ADCGB_CGB0_SIZE                          equ 0001h
ADCGB_CGB0_LENGTH                        equ 0001h
ADCGB_CGB0_MASK                          equ 0001h
ADCGB_CGB1_POSN                          equ 0001h
ADCGB_CGB1_POSITION                      equ 0001h
ADCGB_CGB1_SIZE                          equ 0001h
ADCGB_CGB1_LENGTH                        equ 0001h
ADCGB_CGB1_MASK                          equ 0002h
ADCGB_CGB2_POSN                          equ 0002h
ADCGB_CGB2_POSITION                      equ 0002h
ADCGB_CGB2_SIZE                          equ 0001h
ADCGB_CGB2_LENGTH                        equ 0001h
ADCGB_CGB2_MASK                          equ 0004h
ADCGB_CGB3_POSN                          equ 0003h
ADCGB_CGB3_POSITION                      equ 0003h
ADCGB_CGB3_SIZE                          equ 0001h
ADCGB_CGB3_LENGTH                        equ 0001h
ADCGB_CGB3_MASK                          equ 0008h
ADCGB_CGB4_POSN                          equ 0004h
ADCGB_CGB4_POSITION                      equ 0004h
ADCGB_CGB4_SIZE                          equ 0001h
ADCGB_CGB4_LENGTH                        equ 0001h
ADCGB_CGB4_MASK                          equ 0010h
ADCGB_CGB5_POSN                          equ 0005h
ADCGB_CGB5_POSITION                      equ 0005h
ADCGB_CGB5_SIZE                          equ 0001h
ADCGB_CGB5_LENGTH                        equ 0001h
ADCGB_CGB5_MASK                          equ 0020h
ADCGB_CGB6_POSN                          equ 0006h
ADCGB_CGB6_POSITION                      equ 0006h
ADCGB_CGB6_SIZE                          equ 0001h
ADCGB_CGB6_LENGTH                        equ 0001h
ADCGB_CGB6_MASK                          equ 0040h
ADCGB_CGB7_POSN                          equ 0007h
ADCGB_CGB7_POSITION                      equ 0007h
ADCGB_CGB7_SIZE                          equ 0001h
ADCGB_CGB7_LENGTH                        equ 0001h
ADCGB_CGB7_MASK                          equ 0080h
ADCGB_ADCGB0_POSN                        equ 0000h
ADCGB_ADCGB0_POSITION                    equ 0000h
ADCGB_ADCGB0_SIZE                        equ 0001h
ADCGB_ADCGB0_LENGTH                      equ 0001h
ADCGB_ADCGB0_MASK                        equ 0001h
ADCGB_ADCGB1_POSN                        equ 0001h
ADCGB_ADCGB1_POSITION                    equ 0001h
ADCGB_ADCGB1_SIZE                        equ 0001h
ADCGB_ADCGB1_LENGTH                      equ 0001h
ADCGB_ADCGB1_MASK                        equ 0002h
ADCGB_ADCGB2_POSN                        equ 0002h
ADCGB_ADCGB2_POSITION                    equ 0002h
ADCGB_ADCGB2_SIZE                        equ 0001h
ADCGB_ADCGB2_LENGTH                      equ 0001h
ADCGB_ADCGB2_MASK                        equ 0004h
ADCGB_ADCGB3_POSN                        equ 0003h
ADCGB_ADCGB3_POSITION                    equ 0003h
ADCGB_ADCGB3_SIZE                        equ 0001h
ADCGB_ADCGB3_LENGTH                      equ 0001h
ADCGB_ADCGB3_MASK                        equ 0008h
ADCGB_ADCGB4_POSN                        equ 0004h
ADCGB_ADCGB4_POSITION                    equ 0004h
ADCGB_ADCGB4_SIZE                        equ 0001h
ADCGB_ADCGB4_LENGTH                      equ 0001h
ADCGB_ADCGB4_MASK                        equ 0010h
ADCGB_ADCGB5_POSN                        equ 0005h
ADCGB_ADCGB5_POSITION                    equ 0005h
ADCGB_ADCGB5_SIZE                        equ 0001h
ADCGB_ADCGB5_LENGTH                      equ 0001h
ADCGB_ADCGB5_MASK                        equ 0020h
ADCGB_ADCGB6_POSN                        equ 0006h
ADCGB_ADCGB6_POSITION                    equ 0006h
ADCGB_ADCGB6_SIZE                        equ 0001h
ADCGB_ADCGB6_LENGTH                      equ 0001h
ADCGB_ADCGB6_MASK                        equ 0040h
ADCGB_ADCGB7_POSN                        equ 0007h
ADCGB_ADCGB7_POSITION                    equ 0007h
ADCGB_ADCGB7_SIZE                        equ 0001h
ADCGB_ADCGB7_LENGTH                      equ 0001h
ADCGB_ADCGB7_MASK                        equ 0080h

// Register: ADCGC
#define ADCGC ADCGC
ADCGC                                    equ 0112h
// bitfield definitions
ADCGC_CGC0_POSN                          equ 0000h
ADCGC_CGC0_POSITION                      equ 0000h
ADCGC_CGC0_SIZE                          equ 0001h
ADCGC_CGC0_LENGTH                        equ 0001h
ADCGC_CGC0_MASK                          equ 0001h
ADCGC_CGC1_POSN                          equ 0001h
ADCGC_CGC1_POSITION                      equ 0001h
ADCGC_CGC1_SIZE                          equ 0001h
ADCGC_CGC1_LENGTH                        equ 0001h
ADCGC_CGC1_MASK                          equ 0002h
ADCGC_CGC2_POSN                          equ 0002h
ADCGC_CGC2_POSITION                      equ 0002h
ADCGC_CGC2_SIZE                          equ 0001h
ADCGC_CGC2_LENGTH                        equ 0001h
ADCGC_CGC2_MASK                          equ 0004h
ADCGC_CGC3_POSN                          equ 0003h
ADCGC_CGC3_POSITION                      equ 0003h
ADCGC_CGC3_SIZE                          equ 0001h
ADCGC_CGC3_LENGTH                        equ 0001h
ADCGC_CGC3_MASK                          equ 0008h
ADCGC_CGC4_POSN                          equ 0004h
ADCGC_CGC4_POSITION                      equ 0004h
ADCGC_CGC4_SIZE                          equ 0001h
ADCGC_CGC4_LENGTH                        equ 0001h
ADCGC_CGC4_MASK                          equ 0010h
ADCGC_CGC5_POSN                          equ 0005h
ADCGC_CGC5_POSITION                      equ 0005h
ADCGC_CGC5_SIZE                          equ 0001h
ADCGC_CGC5_LENGTH                        equ 0001h
ADCGC_CGC5_MASK                          equ 0020h
ADCGC_CGC6_POSN                          equ 0006h
ADCGC_CGC6_POSITION                      equ 0006h
ADCGC_CGC6_SIZE                          equ 0001h
ADCGC_CGC6_LENGTH                        equ 0001h
ADCGC_CGC6_MASK                          equ 0040h
ADCGC_CGC7_POSN                          equ 0007h
ADCGC_CGC7_POSITION                      equ 0007h
ADCGC_CGC7_SIZE                          equ 0001h
ADCGC_CGC7_LENGTH                        equ 0001h
ADCGC_CGC7_MASK                          equ 0080h
ADCGC_ADCGC0_POSN                        equ 0000h
ADCGC_ADCGC0_POSITION                    equ 0000h
ADCGC_ADCGC0_SIZE                        equ 0001h
ADCGC_ADCGC0_LENGTH                      equ 0001h
ADCGC_ADCGC0_MASK                        equ 0001h
ADCGC_ADCGC1_POSN                        equ 0001h
ADCGC_ADCGC1_POSITION                    equ 0001h
ADCGC_ADCGC1_SIZE                        equ 0001h
ADCGC_ADCGC1_LENGTH                      equ 0001h
ADCGC_ADCGC1_MASK                        equ 0002h
ADCGC_ADCGC2_POSN                        equ 0002h
ADCGC_ADCGC2_POSITION                    equ 0002h
ADCGC_ADCGC2_SIZE                        equ 0001h
ADCGC_ADCGC2_LENGTH                      equ 0001h
ADCGC_ADCGC2_MASK                        equ 0004h
ADCGC_ADCGC3_POSN                        equ 0003h
ADCGC_ADCGC3_POSITION                    equ 0003h
ADCGC_ADCGC3_SIZE                        equ 0001h
ADCGC_ADCGC3_LENGTH                      equ 0001h
ADCGC_ADCGC3_MASK                        equ 0008h
ADCGC_ADCGC4_POSN                        equ 0004h
ADCGC_ADCGC4_POSITION                    equ 0004h
ADCGC_ADCGC4_SIZE                        equ 0001h
ADCGC_ADCGC4_LENGTH                      equ 0001h
ADCGC_ADCGC4_MASK                        equ 0010h
ADCGC_ADCGC5_POSN                        equ 0005h
ADCGC_ADCGC5_POSITION                    equ 0005h
ADCGC_ADCGC5_SIZE                        equ 0001h
ADCGC_ADCGC5_LENGTH                      equ 0001h
ADCGC_ADCGC5_MASK                        equ 0020h
ADCGC_ADCGC6_POSN                        equ 0006h
ADCGC_ADCGC6_POSITION                    equ 0006h
ADCGC_ADCGC6_SIZE                        equ 0001h
ADCGC_ADCGC6_LENGTH                      equ 0001h
ADCGC_ADCGC6_MASK                        equ 0040h
ADCGC_ADCGC7_POSN                        equ 0007h
ADCGC_ADCGC7_POSITION                    equ 0007h
ADCGC_ADCGC7_SIZE                        equ 0001h
ADCGC_ADCGC7_LENGTH                      equ 0001h
ADCGC_ADCGC7_MASK                        equ 0080h

