garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
// Register: CCP2CAP
#define CCP2CAP CCP2CAP
CCP2CAP                                  equ 0347h
// bitfield definitions
CCP2CAP_CTS_POSN                         equ 0000h
CCP2CAP_CTS_POSITION                     equ 0000h
CCP2CAP_CTS_SIZE                         equ 0008h
CCP2CAP_CTS_LENGTH                       equ 0008h
CCP2CAP_CTS_MASK                         equ 00FFh
CCP2CAP_CTS0_POSN                        equ 0000h
CCP2CAP_CTS0_POSITION                    equ 0000h
CCP2CAP_CTS0_SIZE                        equ 0001h
CCP2CAP_CTS0_LENGTH                      equ 0001h
CCP2CAP_CTS0_MASK                        equ 0001h
CCP2CAP_CTS1_POSN                        equ 0001h
CCP2CAP_CTS1_POSITION                    equ 0001h
CCP2CAP_CTS1_SIZE                        equ 0001h
CCP2CAP_CTS1_LENGTH                      equ 0001h
CCP2CAP_CTS1_MASK                        equ 0002h
CCP2CAP_CTS2_POSN                        equ 0002h
CCP2CAP_CTS2_POSITION                    equ 0002h
CCP2CAP_CTS2_SIZE                        equ 0001h
CCP2CAP_CTS2_LENGTH                      equ 0001h
CCP2CAP_CTS2_MASK                        equ 0004h
CCP2CAP_CTS3_POSN                        equ 0003h
CCP2CAP_CTS3_POSITION                    equ 0003h
CCP2CAP_CTS3_SIZE                        equ 0001h
CCP2CAP_CTS3_LENGTH                      equ 0001h
CCP2CAP_CTS3_MASK                        equ 0008h
CCP2CAP_CCP2CTS_POSN                     equ 0000h
CCP2CAP_CCP2CTS_POSITION                 equ 0000h
CCP2CAP_CCP2CTS_SIZE                     equ 0008h
CCP2CAP_CCP2CTS_LENGTH                   equ 0008h
CCP2CAP_CCP2CTS_MASK                     equ 00FFh
CCP2CAP_CCP2CTS0_POSN                    equ 0000h
CCP2CAP_CCP2CTS0_POSITION                equ 0000h
CCP2CAP_CCP2CTS0_SIZE                    equ 0001h
CCP2CAP_CCP2CTS0_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS0_MASK                    equ 0001h
CCP2CAP_CCP2CTS1_POSN                    equ 0001h
CCP2CAP_CCP2CTS1_POSITION                equ 0001h
CCP2CAP_CCP2CTS1_SIZE                    equ 0001h
CCP2CAP_CCP2CTS1_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS1_MASK                    equ 0002h
CCP2CAP_CCP2CTS2_POSN                    equ 0002h
CCP2CAP_CCP2CTS2_POSITION                equ 0002h
CCP2CAP_CCP2CTS2_SIZE                    equ 0001h
CCP2CAP_CCP2CTS2_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS2_MASK                    equ 0004h
CCP2CAP_CCP2CTS3_POSN                    equ 0003h
CCP2CAP_CCP2CTS3_POSITION                equ 0003h
CCP2CAP_CCP2CTS3_SIZE                    equ 0001h
CCP2CAP_CCP2CTS3_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS3_MASK                    equ 0008h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 034Ch
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C2TSEL0_POSN                    equ 0002h
CCPTMRS0_C2TSEL0_POSITION                equ 0002h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0004h
CCPTMRS0_C2TSEL1_POSN                    equ 0003h
CCPTMRS0_C2TSEL1_POSITION                equ 0003h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0008h

// Register: CRCDATA
#define CRCDATA CRCDATA
CRCDATA                                  equ 034Eh

// Register: CRCDATAL
#define CRCDATAL CRCDATAL
CRCDATAL                                 equ 034Eh
// bitfield definitions
CRCDATAL_DATA_POSN                       equ 0000h
CRCDATAL_DATA_POSITION                   equ 0000h
CRCDATAL_DATA_SIZE                       equ 0008h
CRCDATAL_DATA_LENGTH                     equ 0008h
CRCDATAL_DATA_MASK                       equ 00FFh
CRCDATAL_DATA0_POSN                      equ 0000h
CRCDATAL_DATA0_POSITION                  equ 0000h
CRCDATAL_DATA0_SIZE                      equ 0001h
CRCDATAL_DATA0_LENGTH                    equ 0001h
CRCDATAL_DATA0_MASK                      equ 0001h
CRCDATAL_DATA1_POSN                      equ 0001h
CRCDATAL_DATA1_POSITION                  equ 0001h
CRCDATAL_DATA1_SIZE                      equ 0001h
CRCDATAL_DATA1_LENGTH                    equ 0001h
CRCDATAL_DATA1_MASK                      equ 0002h
CRCDATAL_DATA2_POSN                      equ 0002h
CRCDATAL_DATA2_POSITION                  equ 0002h
CRCDATAL_DATA2_SIZE                      equ 0001h
CRCDATAL_DATA2_LENGTH                    equ 0001h
CRCDATAL_DATA2_MASK                      equ 0004h
CRCDATAL_DATA3_POSN                      equ 0003h
CRCDATAL_DATA3_POSITION                  equ 0003h
CRCDATAL_DATA3_SIZE                      equ 0001h
CRCDATAL_DATA3_LENGTH                    equ 0001h
CRCDATAL_DATA3_MASK                      equ 0008h
CRCDATAL_DATA4_POSN                      equ 0004h
CRCDATAL_DATA4_POSITION                  equ 0004h
CRCDATAL_DATA4_SIZE                      equ 0001h
CRCDATAL_DATA4_LENGTH                    equ 0001h
CRCDATAL_DATA4_MASK                      equ 0010h
CRCDATAL_DATA5_POSN                      equ 0005h
CRCDATAL_DATA5_POSITION                  equ 0005h
CRCDATAL_DATA5_SIZE                      equ 0001h
CRCDATAL_DATA5_LENGTH                    equ 0001h
CRCDATAL_DATA5_MASK                      equ 0020h
CRCDATAL_DATA6_POSN                      equ 0006h
CRCDATAL_DATA6_POSITION                  equ 0006h
CRCDATAL_DATA6_SIZE                      equ 0001h
CRCDATAL_DATA6_LENGTH                    equ 0001h
CRCDATAL_DATA6_MASK                      equ 0040h
CRCDATAL_DATA7_POSN                      equ 0007h
CRCDATAL_DATA7_POSITION                  equ 0007h
CRCDATAL_DATA7_SIZE                      equ 0001h
CRCDATAL_DATA7_LENGTH                    equ 0001h
CRCDATAL_DATA7_MASK                      equ 0080h

// Register: CRCDATAH
#define CRCDATAH CRCDATAH
CRCDATAH                                 equ 034Fh
// bitfield definitions
CRCDATAH_DATA_POSN                       equ 0000h
CRCDATAH_DATA_POSITION                   equ 0000h
CRCDATAH_DATA_SIZE                       equ 0008h
CRCDATAH_DATA_LENGTH                     equ 0008h
CRCDATAH_DATA_MASK                       equ 00FFh
CRCDATAH_DATA8_POSN                      equ 0000h
CRCDATAH_DATA8_POSITION                  equ 0000h
CRCDATAH_DATA8_SIZE                      equ 0001h
CRCDATAH_DATA8_LENGTH                    equ 0001h
CRCDATAH_DATA8_MASK                      equ 0001h
CRCDATAH_DATA9_POSN                      equ 0001h
CRCDATAH_DATA9_POSITION                  equ 0001h
CRCDATAH_DATA9_SIZE                      equ 0001h
CRCDATAH_DATA9_LENGTH                    equ 0001h
CRCDATAH_DATA9_MASK                      equ 0002h
CRCDATAH_DATA10_POSN                     equ 0002h
CRCDATAH_DATA10_POSITION                 equ 0002h
CRCDATAH_DATA10_SIZE                     equ 0001h
CRCDATAH_DATA10_LENGTH                   equ 0001h
CRCDATAH_DATA10_MASK                     equ 0004h
CRCDATAH_DATA11_POSN                     equ 0003h
CRCDATAH_DATA11_POSITION                 equ 0003h
CRCDATAH_DATA11_SIZE                     equ 0001h
CRCDATAH_DATA11_LENGTH                   equ 0001h
CRCDATAH_DATA11_MASK                     equ 0008h
CRCDATAH_DATA12_POSN                     equ 0004h
CRCDATAH_DATA12_POSITION                 equ 0004h
CRCDATAH_DATA12_SIZE                     equ 0001h
CRCDATAH_DATA12_LENGTH                   equ 0001h
CRCDATAH_DATA12_MASK                     equ 0010h
CRCDATAH_DATA13_POSN                     equ 0005h
CRCDATAH_DATA13_POSITION                 equ 0005h
CRCDATAH_DATA13_SIZE                     equ 0001h
CRCDATAH_DATA13_LENGTH                   equ 0001h
CRCDATAH_DATA13_MASK                     equ 0020h
CRCDATAH_DATA14_POSN                     equ 0006h
CRCDATAH_DATA14_POSITION                 equ 0006h
CRCDATAH_DATA14_SIZE                     equ 0001h
CRCDATAH_DATA14_LENGTH                   equ 0001h
CRCDATAH_DATA14_MASK                     equ 0040h
CRCDATAH_DATA15_POSN                     equ 0007h
CRCDATAH_DATA15_POSITION                 equ 0007h
CRCDATAH_DATA15_SIZE                     equ 0001h
CRCDATAH_DATA15_LENGTH                   equ 0001h
CRCDATAH_DATA15_MASK                     equ 0080h

