garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
// Register: INTCON1
#define INTCON1 INTCON1
INTCON1                                  equ 04D7h
// bitfield definitions
INTCON1_STAT_POSN                        equ 0006h
INTCON1_STAT_POSITION                    equ 0006h
INTCON1_STAT_SIZE                        equ 0002h
INTCON1_STAT_LENGTH                      equ 0002h
INTCON1_STAT_MASK                        equ 00C0h
INTCON1_STAT0_POSN                       equ 0006h
INTCON1_STAT0_POSITION                   equ 0006h
INTCON1_STAT0_SIZE                       equ 0001h
INTCON1_STAT0_LENGTH                     equ 0001h
INTCON1_STAT0_MASK                       equ 0040h
INTCON1_STAT1_POSN                       equ 0007h
INTCON1_STAT1_POSITION                   equ 0007h
INTCON1_STAT1_SIZE                       equ 0001h
INTCON1_STAT1_LENGTH                     equ 0001h
INTCON1_STAT1_MASK                       equ 0080h

// Register: STATUS
#define STATUS STATUS
STATUS                                   equ 04D8h
// bitfield definitions
STATUS_NOT_PD_POSN                       equ 0005h
STATUS_NOT_PD_POSITION                   equ 0005h
STATUS_NOT_PD_SIZE                       equ 0001h
STATUS_NOT_PD_LENGTH                     equ 0001h
STATUS_NOT_PD_MASK                       equ 0020h
STATUS_NOT_TO_POSN                       equ 0006h
STATUS_NOT_TO_POSITION                   equ 0006h
STATUS_NOT_TO_SIZE                       equ 0001h
STATUS_NOT_TO_LENGTH                     equ 0001h
STATUS_NOT_TO_MASK                       equ 0040h
STATUS_C_POSN                            equ 0000h
STATUS_C_POSITION                        equ 0000h
STATUS_C_SIZE                            equ 0001h
STATUS_C_LENGTH                          equ 0001h
STATUS_C_MASK                            equ 0001h
STATUS_DC_POSN                           equ 0001h
STATUS_DC_POSITION                       equ 0001h
STATUS_DC_SIZE                           equ 0001h
STATUS_DC_LENGTH                         equ 0001h
STATUS_DC_MASK                           equ 0002h
STATUS_Z_POSN                            equ 0002h
STATUS_Z_POSITION                        equ 0002h
STATUS_Z_SIZE                            equ 0001h
STATUS_Z_LENGTH                          equ 0001h
STATUS_Z_MASK                            equ 0004h
STATUS_OV_POSN                           equ 0003h
STATUS_OV_POSITION                       equ 0003h
STATUS_OV_SIZE                           equ 0001h
STATUS_OV_LENGTH                         equ 0001h
STATUS_OV_MASK                           equ 0008h
STATUS_N_POSN                            equ 0004h
STATUS_N_POSITION                        equ 0004h
STATUS_N_SIZE                            equ 0001h
STATUS_N_LENGTH                          equ 0001h
STATUS_N_MASK                            equ 0010h
STATUS_nPD_POSN                          equ 0005h
STATUS_nPD_POSITION                      equ 0005h
STATUS_nPD_SIZE                          equ 0001h
STATUS_nPD_LENGTH                        equ 0001h
STATUS_nPD_MASK                          equ 0020h
STATUS_nTO_POSN                          equ 0006h
STATUS_nTO_POSITION                      equ 0006h
STATUS_nTO_SIZE                          equ 0001h
STATUS_nTO_LENGTH                        equ 0001h
STATUS_nTO_MASK                          equ 0040h
STATUS_PD_POSN                           equ 0005h
STATUS_PD_POSITION                       equ 0005h
STATUS_PD_SIZE                           equ 0001h
STATUS_PD_LENGTH                         equ 0001h
STATUS_PD_MASK                           equ 0020h
STATUS_TO_POSN                           equ 0006h
STATUS_TO_POSITION                       equ 0006h
STATUS_TO_SIZE                           equ 0001h
STATUS_TO_LENGTH                         equ 0001h
STATUS_TO_MASK                           equ 0040h

// Register: FSR2
#define FSR2 FSR2
FSR2                                     equ 04D9h

// Register: FSR2L
#define FSR2L FSR2L
FSR2L                                    equ 04D9h
// bitfield definitions
FSR2L_FSR2L_POSN                         equ 0000h
FSR2L_FSR2L_POSITION                     equ 0000h
FSR2L_FSR2L_SIZE                         equ 0008h
FSR2L_FSR2L_LENGTH                       equ 0008h
FSR2L_FSR2L_MASK                         equ 00FFh

// Register: FSR2H
#define FSR2H FSR2H
FSR2H                                    equ 04DAh

// Register: PLUSW2
#define PLUSW2 PLUSW2
PLUSW2                                   equ 04DBh
// bitfield definitions
PLUSW2_PLUSW2_POSN                       equ 0000h
PLUSW2_PLUSW2_POSITION                   equ 0000h
PLUSW2_PLUSW2_SIZE                       equ 0008h
PLUSW2_PLUSW2_LENGTH                     equ 0008h
PLUSW2_PLUSW2_MASK                       equ 00FFh

// Register: PREINC2
#define PREINC2 PREINC2
PREINC2                                  equ 04DCh
// bitfield definitions
PREINC2_PREINC2_POSN                     equ 0000h
PREINC2_PREINC2_POSITION                 equ 0000h
PREINC2_PREINC2_SIZE                     equ 0008h
PREINC2_PREINC2_LENGTH                   equ 0008h
PREINC2_PREINC2_MASK                     equ 00FFh

// Register: POSTDEC2
#define POSTDEC2 POSTDEC2
POSTDEC2                                 equ 04DDh
// bitfield definitions
POSTDEC2_POSTDEC2_POSN                   equ 0000h
POSTDEC2_POSTDEC2_POSITION               equ 0000h
POSTDEC2_POSTDEC2_SIZE                   equ 0008h
POSTDEC2_POSTDEC2_LENGTH                 equ 0008h
POSTDEC2_POSTDEC2_MASK                   equ 00FFh

// Register: POSTINC2
#define POSTINC2 POSTINC2
POSTINC2                                 equ 04DEh
// bitfield definitions
POSTINC2_POSTINC2_POSN                   equ 0000h
POSTINC2_POSTINC2_POSITION               equ 0000h
POSTINC2_POSTINC2_SIZE                   equ 0008h
POSTINC2_POSTINC2_LENGTH                 equ 0008h
POSTINC2_POSTINC2_MASK                   equ 00FFh

// Register: INDF2
#define INDF2 INDF2
INDF2                                    equ 04DFh
// bitfield definitions
INDF2_INDF2_POSN                         equ 0000h
INDF2_INDF2_POSITION                     equ 0000h
INDF2_INDF2_SIZE                         equ 0008h
INDF2_INDF2_LENGTH                       equ 0008h
INDF2_INDF2_MASK                         equ 00FFh

