garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.inc
#define DMA4DCNTIF                       BANKMASK(PIR10), 5, a
#define DMA4DCNTIP                       BANKMASK(IPR10), 5, a
#define DMA4MD                           BANKMASK(PMD5), 0, b
#define DMA4ORIE                         BANKMASK(PIE10), 6, a
#define DMA4ORIF                         BANKMASK(PIR10), 6, a
#define DMA4ORIP                         BANKMASK(IPR10), 6, a
#define DMA4PR0                          BANKMASK(DMA4PR), 0, b
#define DMA4PR1                          BANKMASK(DMA4PR), 1, b
#define DMA4PR2                          BANKMASK(DMA4PR), 2, b
#define DMA4SCNTIE                       BANKMASK(PIE10), 4, a
#define DMA4SCNTIF                       BANKMASK(PIR10), 4, a
#define DMA4SCNTIP                       BANKMASK(IPR10), 4, a
#define DOE                              BANKMASK(CPUDOZE), 4, a
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, a
#define DOZE1                            BANKMASK(CPUDOZE), 1, a
#define DOZE2                            BANKMASK(CPUDOZE), 2, a
#define DOZEN                            BANKMASK(CPUDOZE), 6, a
#define DPTR0                            BANKMASK(DMAnDPTRL), 0, b
#define DPTR1                            BANKMASK(DMAnDPTRL), 1, b
#define DPTR10                           BANKMASK(DMAnDPTRH), 2, b
#define DPTR11                           BANKMASK(DMAnDPTRH), 3, b
#define DPTR12                           BANKMASK(DMAnDPTRH), 4, b
#define DPTR13                           BANKMASK(DMAnDPTRH), 5, b
#define DPTR14                           BANKMASK(DMAnDPTRH), 6, b
#define DPTR15                           BANKMASK(DMAnDPTRH), 7, b
#define DPTR2                            BANKMASK(DMAnDPTRL), 2, b
#define DPTR3                            BANKMASK(DMAnDPTRL), 3, b
#define DPTR4                            BANKMASK(DMAnDPTRL), 4, b
#define DPTR5                            BANKMASK(DMAnDPTRL), 5, b
#define DPTR6                            BANKMASK(DMAnDPTRL), 6, b
#define DPTR7                            BANKMASK(DMAnDPTRL), 7, b
#define DPTR8                            BANKMASK(DMAnDPTRH), 0, b
#define DPTR9                            BANKMASK(DMAnDPTRH), 1, b
#define DSA0                             BANKMASK(DMAnDSAL), 0, b
#define DSA1                             BANKMASK(DMAnDSAL), 1, b
#define DSA10                            BANKMASK(DMAnDSAH), 2, b
#define DSA11                            BANKMASK(DMAnDSAH), 3, b
#define DSA12                            BANKMASK(DMAnDSAH), 4, b
#define DSA13                            BANKMASK(DMAnDSAH), 5, b
#define DSA14                            BANKMASK(DMAnDSAH), 6, b
#define DSA15                            BANKMASK(DMAnDSAH), 7, b
#define DSA2                             BANKMASK(DMAnDSAL), 2, b
#define DSA3                             BANKMASK(DMAnDSAL), 3, b
#define DSA4                             BANKMASK(DMAnDSAL), 4, b
#define DSA5                             BANKMASK(DMAnDSAL), 5, b
#define DSA6                             BANKMASK(DMAnDSAL), 6, b
#define DSA7                             BANKMASK(DMAnDSAL), 7, b
#define DSA8                             BANKMASK(DMAnDSAH), 0, b
#define DSA9                             BANKMASK(DMAnDSAH), 1, b
#define DSEN                             BANKMASK(ADCON1), 0, b
#define DSTP                             BANKMASK(DMAnCON1), 5, b
#define DSZ0                             BANKMASK(DMAnDSZL), 0, b
#define DSZ1                             BANKMASK(DMAnDSZL), 1, b
#define DSZ10                            BANKMASK(DMAnDSZH), 2, b
#define DSZ11                            BANKMASK(DMAnDSZH), 3, b
#define DSZ2                             BANKMASK(DMAnDSZL), 2, b
#define DSZ3                             BANKMASK(DMAnDSZL), 3, b
#define DSZ4                             BANKMASK(DMAnDSZL), 4, b
#define DSZ5                             BANKMASK(DMAnDSZL), 5, b
#define DSZ6                             BANKMASK(DMAnDSZL), 6, b
#define DSZ7                             BANKMASK(DMAnDSZL), 7, b
#define DSZ8                             BANKMASK(DMAnDSZH), 0, b
#define DSZ9                             BANKMASK(DMAnDSZH), 1, b
#define EOSIE                            BANKMASK(SPI1INTE), 4, b
#define EOSIF                            BANKMASK(SPI1INTF), 4, b
#define ERR0                             BANKMASK(ADERRL), 0, b
#define ERR1                             BANKMASK(ADERRL), 1, b
#define ERR10                            BANKMASK(ADERRH), 2, b
#define ERR11                            BANKMASK(ADERRH), 3, b
#define ERR12                            BANKMASK(ADERRH), 4, b
#define ERR13                            BANKMASK(ADERRH), 5, b
#define ERR14                            BANKMASK(ADERRH), 6, b
#define ERR15                            BANKMASK(ADERRH), 7, b
#define ERR2                             BANKMASK(ADERRL), 2, b
#define ERR3                             BANKMASK(ADERRL), 3, b
#define ERR4                             BANKMASK(ADERRL), 4, b
#define ERR5                             BANKMASK(ADERRL), 5, b
#define ERR6                             BANKMASK(ADERRL), 6, b
#define ERR7                             BANKMASK(ADERRL), 7, b
#define ERR8                             BANKMASK(ADERRH), 0, b
#define ERR9                             BANKMASK(ADERRH), 1, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define FLTR0                            BANKMASK(ADFLTRL), 0, b
#define FLTR1                            BANKMASK(ADFLTRL), 1, b
#define FLTR10                           BANKMASK(ADFLTRH), 2, b
#define FLTR11                           BANKMASK(ADFLTRH), 3, b
#define FLTR12                           BANKMASK(ADFLTRH), 4, b
#define FLTR13                           BANKMASK(ADFLTRH), 5, b
#define FLTR14                           BANKMASK(ADFLTRH), 6, b
#define FLTR15                           BANKMASK(ADFLTRH), 7, b
#define FLTR2                            BANKMASK(ADFLTRL), 2, b
#define FLTR3                            BANKMASK(ADFLTRL), 3, b
#define FLTR4                            BANKMASK(ADFLTRL), 4, b
#define FLTR5                            BANKMASK(ADFLTRL), 5, b
#define FLTR6                            BANKMASK(ADFLTRL), 6, b
#define FLTR7                            BANKMASK(ADFLTRL), 7, b
#define FLTR8                            BANKMASK(ADFLTRH), 0, b
#define FLTR9                            BANKMASK(ADFLTRH), 1, b
#define FM0                              BANKMASK(ADCON0), 2, b
#define FM1                              BANKMASK(ADCON0), 3, b
#define FME0                             BANKMASK(I2C1CON3), 2, b
#define FME1                             BANKMASK(I2C1CON3), 3, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FSCMFEV                          BANKMASK(FSCMCON), 0, b
#define FSCMFFI                          BANKMASK(FSCMCON), 1, b
#define FSCMPEV                          BANKMASK(FSCMCON), 2, b
#define FSCMPFI                          BANKMASK(FSCMCON), 3, b
#define FSCMSEV                          BANKMASK(FSCMCON), 4, b
#define FSCMSFI                          BANKMASK(FSCMCON), 5, b
#define FST                              BANKMASK(SPI1CON1), 4, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1D1N                            BANKMASK(CLCnGLS0), 0, b
#define G1D1T                            BANKMASK(CLCnGLS0), 1, b
#define G1D2N                            BANKMASK(CLCnGLS0), 2, b
#define G1D2T                            BANKMASK(CLCnGLS0), 3, b
#define G1D3N                            BANKMASK(CLCnGLS0), 4, b
#define G1D3T                            BANKMASK(CLCnGLS0), 5, b
#define G1D4N                            BANKMASK(CLCnGLS0), 6, b
#define G1D4T                            BANKMASK(CLCnGLS0), 7, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define G1POL                            BANKMASK(CLCnPOL), 0, b
#define G2D1N                            BANKMASK(CLCnGLS1), 0, b
#define G2D1T                            BANKMASK(CLCnGLS1), 1, b
#define G2D2N                            BANKMASK(CLCnGLS1), 2, b
#define G2D2T                            BANKMASK(CLCnGLS1), 3, b
#define G2D3N                            BANKMASK(CLCnGLS1), 4, b
#define G2D3T                            BANKMASK(CLCnGLS1), 5, b
#define G2D4N                            BANKMASK(CLCnGLS1), 6, b
#define G2D4T                            BANKMASK(CLCnGLS1), 7, b
#define G2POL                            BANKMASK(CLCnPOL), 1, b
#define G3D1N                            BANKMASK(CLCnGLS2), 0, b
#define G3D1T                            BANKMASK(CLCnGLS2), 1, b
#define G3D2N                            BANKMASK(CLCnGLS2), 2, b
#define G3D2T                            BANKMASK(CLCnGLS2), 3, b
#define G3D3N                            BANKMASK(CLCnGLS2), 4, b
#define G3D3T                            BANKMASK(CLCnGLS2), 5, b
#define G3D4N                            BANKMASK(CLCnGLS2), 6, b
#define G3D4T                            BANKMASK(CLCnGLS2), 7, b
#define G3POL                            BANKMASK(CLCnPOL), 2, b
#define G4D1N                            BANKMASK(CLCnGLS3), 0, b
#define G4D1T                            BANKMASK(CLCnGLS3), 1, b
#define G4D2N                            BANKMASK(CLCnGLS3), 2, b
#define G4D2T                            BANKMASK(CLCnGLS3), 3, b
#define G4D3N                            BANKMASK(CLCnGLS3), 4, b
#define G4D3T                            BANKMASK(CLCnGLS3), 5, b
#define G4D4N                            BANKMASK(CLCnGLS3), 6, b
#define G4D4T                            BANKMASK(CLCnGLS3), 7, b
#define G4POL                            BANKMASK(CLCnPOL), 3, b
#define GCEN                             BANKMASK(I2C1CON2), 6, b
#define GIE                              BANKMASK(INTCON0), 7, a
#define GIEH                             BANKMASK(INTCON0), 7, a
#define GIEL                             BANKMASK(INTCON0), 6, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, b
#define GO_nDONE                         BANKMASK(ADCON0), 0, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE0), 1, a
#define HLVDIF                           BANKMASK(PIR0), 1, a
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR0), 1, a
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C1CNT0                         BANKMASK(I2C1CNTL), 0, b
#define I2C1CNT1                         BANKMASK(I2C1CNTL), 1, b
#define I2C1CNT10                        BANKMASK(I2C1CNTH), 2, b
#define I2C1CNT11                        BANKMASK(I2C1CNTH), 3, b
#define I2C1CNT12                        BANKMASK(I2C1CNTH), 4, b
#define I2C1CNT13                        BANKMASK(I2C1CNTH), 5, b
#define I2C1CNT14                        BANKMASK(I2C1CNTH), 6, b
#define I2C1CNT15                        BANKMASK(I2C1CNTH), 7, b
#define I2C1CNT2                         BANKMASK(I2C1CNTL), 2, b
#define I2C1CNT3                         BANKMASK(I2C1CNTL), 3, b
#define I2C1CNT4                         BANKMASK(I2C1CNTL), 4, b
#define I2C1CNT5                         BANKMASK(I2C1CNTL), 5, b
#define I2C1CNT6                         BANKMASK(I2C1CNTL), 6, b
#define I2C1CNT7                         BANKMASK(I2C1CNTL), 7, b
#define I2C1CNT8                         BANKMASK(I2C1CNTH), 0, b
#define I2C1CNT9                         BANKMASK(I2C1CNTH), 1, b
#define I2C1EIE                          BANKMASK(PIE7), 3, a
#define I2C1EIF                          BANKMASK(PIR7), 3, a
#define I2C1EIP                          BANKMASK(IPR7), 3, a
#define I2C1IE                           BANKMASK(PIE7), 2, a
#define I2C1IF                           BANKMASK(PIR7), 2, a
#define I2C1IP                           BANKMASK(IPR7), 2, a
#define I2C1MD                           BANKMASK(PMD3), 3, b
#define I2C1RXIE                         BANKMASK(PIE7), 0, a
#define I2C1RXIF                         BANKMASK(PIR7), 0, a
#define I2C1RXIP                         BANKMASK(IPR7), 0, a
#define I2C1SCLPPS0                      BANKMASK(I2C1SCLPPS), 0, b
#define I2C1SCLPPS1                      BANKMASK(I2C1SCLPPS), 1, b
#define I2C1SCLPPS2                      BANKMASK(I2C1SCLPPS), 2, b
#define I2C1SCLPPS3                      BANKMASK(I2C1SCLPPS), 3, b
#define I2C1SCLPPS4                      BANKMASK(I2C1SCLPPS), 4, b
#define I2C1SCLPPS5                      BANKMASK(I2C1SCLPPS), 5, b
#define I2C1SDAPPS0                      BANKMASK(I2C1SDAPPS), 0, b
#define I2C1SDAPPS1                      BANKMASK(I2C1SDAPPS), 1, b
#define I2C1SDAPPS2                      BANKMASK(I2C1SDAPPS), 2, b
#define I2C1SDAPPS3                      BANKMASK(I2C1SDAPPS), 3, b
#define I2C1SDAPPS4                      BANKMASK(I2C1SDAPPS), 4, b
#define I2C1SDAPPS5                      BANKMASK(I2C1SDAPPS), 5, b
#define I2C1TXIE                         BANKMASK(PIE7), 1, a
#define I2C1TXIF                         BANKMASK(PIR7), 1, a
#define I2C1TXIP                         BANKMASK(IPR7), 1, a
#define I2CBTOC0                         BANKMASK(I2C1BTOC), 0, b
#define I2CBTOC1                         BANKMASK(I2C1BTOC), 1, b
#define I2CBTOC2                         BANKMASK(I2C1BTOC), 2, b
#define I2CBTOC3                         BANKMASK(I2C1BTOC), 3, b
#define I2CCLK0                          BANKMASK(I2C1CLK), 0, b
#define I2CCLK1                          BANKMASK(I2C1CLK), 1, b
#define I2CCLK2                          BANKMASK(I2C1CLK), 2, b
#define I2CCLK3                          BANKMASK(I2C1CLK), 3, b
#define I2CCLK4                          BANKMASK(I2C1CLK), 4, b
#define I2CEN                            BANKMASK(I2C1CON0), 7, b
#define IC                               BANKMASK(ADCON0), 1, b
#define IDLEN                            BANKMASK(CPUDOZE), 7, a
#define IN                               BANKMASK(CWG1CON1), 5, b
#define INC0                             BANKMASK(NCO1INCL), 0, b
#define INC1                             BANKMASK(NCO1INCL), 1, b
#define INC10                            BANKMASK(NCO1INCH), 2, b
#define INC11                            BANKMASK(NCO1INCH), 3, b
#define INC12                            BANKMASK(NCO1INCH), 4, b
#define INC13                            BANKMASK(NCO1INCH), 5, b
#define INC14                            BANKMASK(NCO1INCH), 6, b
#define INC15                            BANKMASK(NCO1INCH), 7, b
#define INC16                            BANKMASK(NCO1INCU), 0, b
#define INC17                            BANKMASK(NCO1INCU), 1, b
#define INC18                            BANKMASK(NCO1INCU), 2, b
#define INC19                            BANKMASK(NCO1INCU), 3, b
#define INC2                             BANKMASK(NCO1INCL), 2, b
#define INC3                             BANKMASK(NCO1INCL), 3, b
#define INC4                             BANKMASK(NCO1INCL), 4, b
#define INC5                             BANKMASK(NCO1INCL), 5, b
#define INC6                             BANKMASK(NCO1INCL), 6, b
#define INC7                             BANKMASK(NCO1INCL), 7, b
#define INC8                             BANKMASK(NCO1INCH), 0, b
#define INC9                             BANKMASK(NCO1INCH), 1, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INT0EDG                          BANKMASK(INTCON0), 0, a
#define INT0IE                           BANKMASK(PIE1), 0, a
#define INT0IF                           BANKMASK(PIR1), 0, a
#define INT0IP                           BANKMASK(IPR1), 0, a
#define INT0PPS0                         BANKMASK(INT0PPS), 0, b
#define INT0PPS1                         BANKMASK(INT0PPS), 1, b
#define INT0PPS2                         BANKMASK(INT0PPS), 2, b
#define INT0PPS3                         BANKMASK(INT0PPS), 3, b
#define INT0PPS4                         BANKMASK(INT0PPS), 4, b
#define INT0PPS5                         BANKMASK(INT0PPS), 5, b
#define INT1EDG                          BANKMASK(INTCON0), 1, a
#define INT1IE                           BANKMASK(PIE6), 0, a
#define INT1IF                           BANKMASK(PIR6), 0, a
#define INT1IP                           BANKMASK(IPR6), 0, a
#define INT1PPS0                         BANKMASK(INT1PPS), 0, b
#define INT1PPS1                         BANKMASK(INT1PPS), 1, b
#define INT1PPS2                         BANKMASK(INT1PPS), 2, b
#define INT1PPS3                         BANKMASK(INT1PPS), 3, b
#define INT1PPS4                         BANKMASK(INT1PPS), 4, b
#define INT1PPS5                         BANKMASK(INT1PPS), 5, b
#define INT2EDG                          BANKMASK(INTCON0), 2, a
#define INT2IE                           BANKMASK(PIE10), 0, a
#define INT2IF                           BANKMASK(PIR10), 0, a
#define INT2IP                           BANKMASK(IPR10), 0, a
#define INT2PPS0                         BANKMASK(INT2PPS), 0, b
#define INT2PPS1                         BANKMASK(INT2PPS), 1, b
#define INT2PPS2                         BANKMASK(INT2PPS), 2, b
#define INT2PPS3                         BANKMASK(INT2PPS), 3, b
#define INT2PPS4                         BANKMASK(INT2PPS), 4, b
#define INT2PPS5                         BANKMASK(INT2PPS), 5, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
